HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PMEM_FDA_OFF (7u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU1_PTAG_FDA_OFF (8u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_OFF (9u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DMEM_FDA_OFF (10u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DTAG_FDA_OFF (11u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PMEM_FDA_OFF (12u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PTAG_FDA_OFF (13u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DLMU_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DLMU_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DLMU_FDA_OFF (14u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DMEM_FDA_OFF (15u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DTAG_FDA_OFF (16u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PMEM_FDA_OFF (17u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PTAG_FDA_OFF (18u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DLMU_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DLMU_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DLMU_FDA_OFF (19u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.LMU00_FDA */
#define IFX_MTU_MEMFDA0_LMU00_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.LMU00_FDA */
#define IFX_MTU_MEMFDA0_LMU00_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.LMU00_FDA */
#define IFX_MTU_MEMFDA0_LMU00_FDA_OFF (30u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.CPU0_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU0_DMEM1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.CPU0_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU0_DMEM1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.CPU0_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU0_DMEM1_FDA_OFF (2u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.CPU1_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU1_DMEM1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.CPU1_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU1_DMEM1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.CPU1_DMEM1_FDA */
#define IFX_MTU_MEMFDA1_CPU1_DMEM1_FDA_OFF (3u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.DAM0_FDA */
#define IFX_MTU_MEMFDA1_DAM0_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.DAM0_FDA */
#define IFX_MTU_MEMFDA1_DAM0_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.DAM0_FDA */
#define IFX_MTU_MEMFDA1_DAM0_FDA_OFF (6u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.SADMA_FDA */
#define IFX_MTU_MEMFDA1_SADMA_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.SADMA_FDA */
#define IFX_MTU_MEMFDA1_SADMA_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.SADMA_FDA */
#define IFX_MTU_MEMFDA1_SADMA_FDA_OFF (9u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.MINI_MCDS_FDA */
#define IFX_MTU_MEMFDA1_MINI_MCDS_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.MINI_MCDS_FDA */
#define IFX_MTU_MEMFDA1_MINI_MCDS_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.MINI_MCDS_FDA */
#define IFX_MTU_MEMFDA1_MINI_MCDS_FDA_OFF (10u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_FIFO_FDA */
#define IFX_MTU_MEMFDA1_GTM_FIFO_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_FIFO_FDA */
#define IFX_MTU_MEMFDA1_GTM_FIFO_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_FIFO_FDA */
#define IFX_MTU_MEMFDA1_GTM_FIFO_FDA_OFF (21u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_MCS0SLOW_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS0SLOW_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_MCS0SLOW_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS0SLOW_FDA_MSK (0x1u)

