HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_MCS0SLOW_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS0SLOW_FDA_OFF (22u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_MCS0FAST_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS0FAST_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_MCS0FAST_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS0FAST_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_MCS0FAST_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS0FAST_FDA_OFF (23u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_MCS1SLOW_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS1SLOW_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_MCS1SLOW_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS1SLOW_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_MCS1SLOW_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS1SLOW_FDA_OFF (24u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_MCS1FAST_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS1FAST_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_MCS1FAST_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS1FAST_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_MCS1FAST_FDA */
#define IFX_MTU_MEMFDA1_GTM_MCS1FAST_FDA_OFF (25u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL1A_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL1A_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL1A_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL1A_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL1A_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL1A_FDA_OFF (26u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL1BC_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL1BC_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL1BC_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL1BC_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL1BC_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL1BC_FDA_OFF (27u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL2_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL2_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL2_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL2_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.GTM_DPLL2_FDA */
#define IFX_MTU_MEMFDA1_GTM_DPLL2_FDA_OFF (28u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.MCAN10_FDA */
#define IFX_MTU_MEMFDA1_MCAN10_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.MCAN10_FDA */
#define IFX_MTU_MEMFDA1_MCAN10_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.MCAN10_FDA */
#define IFX_MTU_MEMFDA1_MCAN10_FDA_OFF (30u)

/** \brief Length for Ifx_MTU_MEMFDA1_Bits.MCAN20_FDA */
#define IFX_MTU_MEMFDA1_MCAN20_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA1_Bits.MCAN20_FDA */
#define IFX_MTU_MEMFDA1_MCAN20_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA1_Bits.MCAN20_FDA */
#define IFX_MTU_MEMFDA1_MCAN20_FDA_OFF (31u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.MCAN21_FDA */
#define IFX_MTU_MEMFDA2_MCAN21_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.MCAN21_FDA */
#define IFX_MTU_MEMFDA2_MCAN21_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.MCAN21_FDA */
#define IFX_MTU_MEMFDA2_MCAN21_FDA_OFF (0u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.PSI5_FDA */
#define IFX_MTU_MEMFDA2_PSI5_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.PSI5_FDA */
#define IFX_MTU_MEMFDA2_PSI5_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.PSI5_FDA */
#define IFX_MTU_MEMFDA2_PSI5_FDA_OFF (1u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.ERAY_OBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_OBF0_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.ERAY_OBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_OBF0_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.ERAY_OBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_OBF0_FDA_OFF (2u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.ERAY_OBF1_FDA */
#define IFX_MTU_MEMFDA2_ERAY_OBF1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.ERAY_OBF1_FDA */
#define IFX_MTU_MEMFDA2_ERAY_OBF1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.ERAY_OBF1_FDA */
#define IFX_MTU_MEMFDA2_ERAY_OBF1_FDA_OFF (3u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.ERAY_TBF_IBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_TBF_IBF0_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.ERAY_TBF_IBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_TBF_IBF0_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.ERAY_TBF_IBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_TBF_IBF0_FDA_OFF (4u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.ERAY_TBF_IBF1_FDA */
#define IFX_MTU_MEMFDA2_ERAY_TBF_IBF1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.ERAY_TBF_IBF1_FDA */
#define IFX_MTU_MEMFDA2_ERAY_TBF_IBF1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.ERAY_TBF_IBF1_FDA */
#define IFX_MTU_MEMFDA2_ERAY_TBF_IBF1_FDA_OFF (5u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.ERAY_MBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_MBF0_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.ERAY_MBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_MBF0_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.ERAY_MBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_MBF0_FDA_OFF (6u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.ERAY_MBF1_FDA */
#define IFX_MTU_MEMFDA2_ERAY_MBF1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.ERAY_MBF1_FDA */
#define IFX_MTU_MEMFDA2_ERAY_MBF1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.ERAY_MBF1_FDA */
#define IFX_MTU_MEMFDA2_ERAY_MBF1_FDA_OFF (7u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SCR_XRAM_FDA */
#define IFX_MTU_MEMFDA2_SCR_XRAM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SCR_XRAM_FDA */
#define IFX_MTU_MEMFDA2_SCR_XRAM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SCR_XRAM_FDA */
#define IFX_MTU_MEMFDA2_SCR_XRAM_FDA_OFF (13u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SCR_RAMINT_FDA */
#define IFX_MTU_MEMFDA2_SCR_RAMINT_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SCR_RAMINT_FDA */
#define IFX_MTU_MEMFDA2_SCR_RAMINT_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SCR_RAMINT_FDA */
#define IFX_MTU_MEMFDA2_SCR_RAMINT_FDA_OFF (14u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.GIGETH_RX_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_RX_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.GIGETH_RX_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_RX_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.GIGETH_RX_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_RX_FDA_OFF (18u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.GIGETH_TX_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_TX_FDA_LEN (1u)

